//שורה זו מייבאת את האקספרס שהיא מסגרת פופולרית לבניית ישומי אינטרנט בנוד גיאס
import express from "express";
//process.env שורה זו מייבאת את הפונקציה קונפיג שמאפשרת לטעון משתני סביבה מקובץ איאנוי לתוך 
import { config } from "dotenv";
// שורות הבאות מייבאות את המודולים מהקבצים וזה מגדיר את הניתובים
import orderRouter from "./routes/orders.js";
import productRouter from "./routes/product.js";
import userRouter from "./routes/user.js";
//מייבאת את הפונקציה של ההתחברות למסד הנתונים
import { connectToDB } from "./config/dbConfig.js";
//ספרייה שמיועדת להגבלת הבקשות
import cors from "cors";
//זה מידאלוואר המטפלת בשגיאות המתרחשות בין הבקשה לתגובה
import { erroHandling } from "./middlewares/errorHandling.js";
//env כך גרמנו שנוד ידע כבר עכשיו לחפש בקובץ ששמו נקודה 
config();
//שורה זו קוראת לפונקציה אשר יוצאת חיבור למסד הנתונים
connectToDB();
//שורה זו יוצרת מופע חדש של היישום אקספרס
const app = express();
//מפעיל פונקציה שמחזירה פונקציה 
//req.body פונקציה אקספרס קוראת לפונקציה אקספרס גיסון כאשר נשלח בגוף הבקשה אוביקט בפורמט גיסון כדי לנתח את הנתונים שנשלחו ולהפוך אותם לזמינים עבור 
app.use(express.json())
//שימוש בספרייה זו כאשר נרצה לאפשר בקשות ממקורות ושיטות ספציפיות
app.use(cors())
// שורה זו מגדירה שרת קבצים סטטי שכאשר ישלחו לי בבקשה כתובת של תמונה שיש לה סיומת של קובץ אז כאשר הוא ניתקל בסיומת קובץ הוא ישר יודע ללכת לתיקייה הזו הסטטית ולחפש בה את התמונה הרצויה
app.use(express.static('images'))
//בשורות הבאות כאשר ישלחו לי לכתובת המצוינת בקשה הוא ישר נכנס לראוטר שלו ואז לפי סוג הבקשה ומה שישלחו אליה אז הוא ניגש לניתוב המתאים
app.use("/api/orders", orderRouter);
app.use("/api/products", productRouter);
app.use("/api/users", userRouter);
//הפעלת המידאלוואר שמחזיר שגיאה בין הבקשה לתגובה בעת הצורך
app.use(erroHandling)
//4000 שורה זו מקבלת את הפורט מהניתוב שניתן לו או
let port = process.env.PORT || 4000;
//שורה זו מפעילה את שרת אקספרס וגורמת לו להאזין לפורט שצוינה לבקשות נכנסות
app.listen(port, () => {
    console.log(`app is listening on port ${port}`)
})
//  לבדוק פוט ודליט בפרודוקט וגם דליט באורדר ןלבדוק גוי של יוזר את הפסורד

  